{
  "common": {
    "switchLanguage": "en",
    "home": "Accueil",
    "about": "À propos",
    "projects": "Projets",
    "close-menu-aria": "Fermeture du menu",
    "open-menu-aria": "Ouverture du menu",
    "mail-aria": "Envoyez moi un email",
    "linkedin-aria": "Visitez mon Linkedin",
    "github-aria": "Visitez mon Github"
  },

  "component-VisitCards": {
    "description-line1": "Bonjour,",
    "description-line2": "Je suis Axel. Un Web Développeur français basé à Genève.",
    "description-line3": "Récemment diplômé en développement web fullstack JavaScript,",
    "description-line4": "je suis désormais à la recherche d'opportunités professionnelles.",
    "mail-aria": "Envoyez moi un email"
  },

  "component-About": {
    "title": "À propos",
    "imgAlt": "Photo de profil",
    "descriptionPart1": "Bienvenue sur mon portfolio ! Je suis Axel, un développeur web FullStack Javascript récemment diplômé de l'école O'Clock. Mon parcours académique m'a permis d'acquérir des compétences approfondies en développement front-end et back-end, tout en intégrant les normes de sécurité et d'accessibilité.",
    "descriptionPart2": "Dans mon approche du développement web, chaque ligne de code est une opportunité d'exprimer ma créativité. Je considère chaque projet comme une toile sur laquelle je peux peindre une expérience utilisateur à la fois captivante et esthétiquement plaisante. Mon soucis du détail est une marque de mon engagement, car je crois fermement que la différence se niche dans les petites choses.",
    "descriptionPart3": "Mon insatiable curiosité me pousse sans cesse à explorer de nouvelles idées et à rechercher des approches innovantes. J'attache une grande importance à comprendre les besoins, à identifier les problèmes et à concevoir des solutions pertinentes. Ma soif de connaissances et ma détermination à concevoir des solutions efficaces et innovantes sont essentielles pour mon parcours de développeur.",

    "descriptionPart4": "Aujourd’hui, mon objectif est de continuer à élargir et à renforcer mes compétences. Je recherche activement de nouveaux défis passionnants qui me permettront de progresser professionnellement. Mon enthousiasme pour la découverte de nouvelles technologies et concepts reste constant.",
    "descriptionPart5": "Mon objectif immédiat est de rejoindre une entreprise partageant ma passion pour l’excellence en développement web.",
    "descriptionPart6": "Je suis prêt à me former en fonction de ses besoins spécifiques pour apporter une contribution active au succès de ses projets, en créant des solutions web robustes, esthétiques et performantes. J’ai hâte de faire partie d’une équipe dynamique et de participer à des projets captivants.",
    "descriptionPart7": "Considérez-moi comme une opportunité d’investissement en évolution constante, destinée à devenir le professionnel idéal pour répondre à vos besoins spécifiques et à vos attentes. C’est la promesse d’un engagement mutuel en vue d’un avenir fructueux.",
    "button": "En savoir plus"
  },

  "component-Contact": {
    "title": "Contact",
    "description": "Pour toute proposition professionnelle, opportunité de collaboration ou simplement pour partager et échanger, n'hésitez pas à me contacter directement sur mes réseaux ou par e-mail à l'adresse suivante :",
    "mail-aria": "Envoyez moi un email ",
    "linkedinIconAlt": "Icone Linkedin",
    "linkedin-aria": "Visitez mon Linkedin",
    "githubIconAlt": "Icone Github",
    "github-aria": "Visitez mon Github"
  },

  "component-Skills": {
    "skillsTitle": "Mes Skills",
    "htmlIconAlt": "Html icone",
    "cssIconAlt": "Css icone",
    "javascriptIconAlt": "Javascript icone",
    "reactIconAlt": "React icone",
    "nextIconAlt": "Nextjs icone",
    "nodeIconAlt": "Nodejs icone",
    "typescriptIconAlt": "Typescript icone",
    "sqlIconAlt": "Sql icone",
    "postgresqlIconAlt": "PostgreSql icone",
    "gitIconAlt": "Git icone",
    "agileIconAlt": "Agile icone",
    "figmaIconAlt": "Figma icone",
    "formationTitle": "Ma formation",
    "formationDescriptionPart1": "Durant ma formation intensive chez O’Clock, j’ai acquis des compétences clé en JavaScript, couvrant le développement front-end, back-end, et la gestion de bases de données.",
    "formationDescriptionPart2": "J’ai choisi de suivre une spécialisation front-end en découvrant React. Puis au terme de ma formation, j’ai décidé de continuer mon apprentissage en suivant une seconde spécialisation Data & API.",
    "button": "En savoir plus"
  },

  "component-Projects": {
    "portfolioImgAlt": "Logo du projet portfolio v1",
    "portfolioDescription": "C'est le projet que vous explorez actuellement. Il propose une plateforme détaillée pour présenter mes compétences, expériences, projets et objectifs. J’ai opté pour un design minimaliste, cherchant à allier l’élégance de la simplicité avec une structure claire et organisée.",
    "vzImgAlt": "Image du projet VictoryZone",
    "vzDescription": "VictoryZone est une application destinée à représenter une équipe E-sport. Le MVP a été réalisé en équipe de 5 sur une durée d'un mois dans le cadre du projet de fin d’études de ma formation chez O’Clock. J'avais le rôle de développeur front-end.",
    "okanbanImgAlt": "Image du projet O'Kanban",
    "okanbanDescription": "O'Kanban est une application de gestion de projet en ligne qui utilise un système de tableau Kanban basé sur le même principe que Trello. J’ai développé cette application fullstack lors de ma formation chez O’Clock."
  },

  "component-Thanks": {
    "message": "Merci de votre visite !"
  },

  "page-about": {
    "me-title": "Qui je suis ?",
    "me-part1-line1": "Bonjour et bienvenue sur mon portfolio !",
    "me-part1-line2": "Je suis Axel Martin, un passionné de 33 ans établi dans la région de Genève.",
    "me-part1-line3": "Depuis mon plus jeune âge, je suis captivé par la frontière entre l’art et la technologie, une fascination qui a guidé mes choix professionnels.",
    "me-part2-line1": "Après avoir exploré divers domaines, j’ai décidé de me lancer en 2023 dans une reconversion professionnelle intensive en me plongeant dans le monde du développement web.",
    "me-part2-line2": "C’est ainsi que j’ai intégré l’école O’Clock, où j’ai suivi une formation complète fullstack JavaScript.",
    "me-part2-line3": "À l’issue de cette formation, j’ai obtenu avec succès le titre professionnel de développeur web et web mobile certifié au RNCP de niveau 5, équivalent à un bac +2.",
    "me-part2-line4": "Cette certification atteste de mes compétences dans la conception et la réalisation de projets web, ainsi que dans le développement d’applications mobiles.",
    "me-part2-line5": "Au fil de ma formation, j’ai élargi mes compétences en suivant une spécialisation front-end basée sur React.",
    "me-part2-line6": "Puis, après l’obtention de mon diplôme, j’ai décidé de continuer mon apprentissage et de suivre une seconde spécialisation back-end basée sur les DATA, API, base de données, langage SQL, sécurité…",
    "me-part2-line7": "Ces expériences m’ont permis d’explorer les multiples facettes de la programmation web, alliant à la fois créativité et rigueur technique.",
    "me-part3-line1": "En-dehors de ma passion pour le développement web, vous me trouverez probablement immergé dans des projets créatifs, sportifs, explorant de nouvelles technologies ou simplement profitant du plein air.",
    "me-part3-line2": "Je suis musicien, bassiste passionné, et je joue au football américain.",
    "me-part3-line3": "Je suis également un fervent amateur d’histoire, de philosophie, de cinéma ainsi que de voyages et découvertes.",
    "me-part3-line4": "Ces diverses passions m’ont permis de développer des compétences telles que la créativité, la collaboration efficace en équipe et la gestion du temps.",
    "me-part3-line5": "Ma pratique du football américain en compétition a renforcé ma capacité à travailler sous pression, m’a enseigné les valeurs du travail d’équipe ainsi que la discipline, tandis que mon engagement dans la musique et les arts m’a appris l’importance du souci du détail et de l’esthétique.",
    "me-part3-line6": "Je crois fermement que ces compétences sont aussi pertinentes dans le monde du développement web que dans mes autres activités, et qu’elles enrichissent ma contribution professionnelle de manière significative.",
    "me-part4-line1": "Si vous souhaitez en apprendre davantage sur mon parcours et avoir plus de détails sur ma formation, je vous invite à visiter la page Skills ou à cliquer sur le lien suivant :",

    "before-title": "Avant ma formation",
    "before-part1-line1": "Avant d’entreprendre ma reconversion professionnelle dans le domaine du développement web, j’ai exploré divers horizons académiques et professionnels.",
    "before-part1-line2": "Au lycée, j’ai suivi des études de commerce, obtenant un brevet d’études professionnelle vente-action marchande.",
    "before-part1-line3": "Par la suite, ma passion m’a guidé vers le son, m’amenant à intégrer une école d’ingénieur du son à Genève, la SAE Institute.",
    "before-part2-line1": "En parallèle de mes études et après leur achèvement, j’ai exploré différents métiers pour élargir mes compétences et découvrir de nouveaux domaines.",
    "before-part2-line2": "Par exemple, j’ai évolué en tant que graphiste chez EG Mask à Genève, concevant des masques pour l’industrie automobile avec Adobe Illustrator.",
    "before-part2-line3": "J’ai également eu l’opportunité de travailler chez Sahy, une entreprise londonienne spécialisée dans la promotion d’athlètes et de marques sportives sur les réseaux sociaux.",
    "before-part2-line4": "Mon rôle consistait à créer du contenu dynamique, à concevoir des éléments graphiques percutants et à stimuler l’engagement de la communauté autour de ces sportifs.",
    "before-part2-line5": "Par la suite, j’ai travaillé dans divers studios d’enregistrement, contribuant à la prise de son, le mixage et la post-production pour des projets musicaux et cinématographiques.",
    "before-part2-line6": "En parallèle, j’ai occupé différents emplois, notamment dans l’industrie, ou j’ai développé des valeurs fondamentales telles que le travail d’équipe, la résilience et le sens de l’organisation.",
    "before-part3-line1": "Ces expériences variées, bien que distinctes de mon chemin actuel, ont enrichi ma perspective professionnelle et ont façonné ma capacité à aborder les défis avec créativité, rigueur et détermination.",

    "goals-title": "Mes Objectifs",
    "goals-part1-line1": "Dans ma quête incessante de connaissances, je suis constamment à la recherche de nouvelles opportunités pour enrichir mes compétences et explorer des horizons technologiques toujours plus vastes.",
    "goals-part1-line2": "Ma formation m’a armé de bases solides nécessaires pour affronter les défis du développement web, mais je ne souhaite pas m’arrêter là.",
    "goals-part1-line3": "Je suis avide de découvrir de nouveaux concepts, d’explorer de nouvelles technologies et de maîtriser des compétences innovantes qui propulseront ma jeune carrière vers de nouveaux sommets.",
    "goals-part2-line1": "Mon objectif est d’intégrer une entreprise dynamique qui partage ma passion pour l’excellence en matière de développement web, qui saura me guider et me perfectionner selon sa vision et ses valeurs dans le but de devenir un élément clé contribuant activement à son succès.",
    "goals-part2-line2": "Je suis prêt à investir pleinement dans ma croissance professionnelle pour devenir un atout précieux au sein de votre équipe en mettant en pratique mon enthousiasme, ma créativité et ma détermination.",
    "goals-part2-line3": "Je suis convaincu que dans un environnement ou règne la collaboration et où l’innovation est encouragée, je pourrai pleinement exprimer mon potentiel.",
    "goals-part3-line1": "Considérez-moi comme une opportunité d’investissement en évolution constante, destinée à devenir le professionnel idéal pour répondre à vos besoins spécifiques et à vos attentes.",
    "goals-part3-line2": "C’est la promesse d’un engagement mutuel en vue d’un avenir fructueux.",
    "goals-part4-line1": "Si vous êtes à la recherche d'un développeur web motivé et déterminé à exceller, je serai ravi de discuter de la façon dont je peux contribuer à votre entreprise et à vos projets.",
    "goals-part5-line1": "Si vous souhaitez en savoir plus sur mon parcours, ma vision, mon potentiel, ou pour toute proposition professionnelle, opportunité de collaboration ou simplement pour partager et échanger, n'hésitez pas à me contacter sur mes réseaux ou directement par e-mail à l'adresse suivante :",

    "img-alt": "Photo de profil",
    "mail-aria": "Envoyez moi un email",
    "linkedin-alt": "Icone Linkedin",
    "linkedin-aria": "Visitez mon Linkedin",
    "github-alt": "Icone Github",
    "github-aria": "Visitez mon Github"
  },

  "page-contact": {
    "description-part1": "En tant que jeune diplômé en développement web, je suis à la recherche de mes premières opportunités professionnelles.",
    "description-part2-line1": "Je suis enthousiaste à l'idée de rejoindre une équipe dynamique et de travailler sur des projets passionnants.",
    "description-part2-line2": "Je suis prêt à croître avec votre entreprise, à apprendre vite et à ajouter une touche de créativité à chaque projet.  Considérez-moi comme un investissement dans l'avenir.",
    "description-part3-line1": "Si vous êtes à la recherche d'un développeur web motivé et déterminé à exceller, je serai ravi de discuter de la façon dont je peux contribuer à votre entreprise. ",
    "description-part3-line2": "N'hésitez pas à me contacter directement par mail ou via Linkedin.",

    "mail-aria": "Envoyez moi un email",
    "linkedin-aria": "Visitez mon Linkedin",
    "github-aria": "Visitez mon Github"
  },

  "page-skills": {
    "skills-title": "Mes Skills",
    "skills-html-alt": "icone language HTML",
    "skills-css-alt": "icone language CSS",
    "skills-js-alt": "icone language JavaScript",
    "skills-react-alt": "icone React",
    "skills-next-alt": "icone Next.js",
    "skills-node-alt": "icone Node.js",
    "skills-typescript-alt": "icone language Typescript",
    "skills-sql-alt": "icone language SQL",
    "skills-pg-alt": "icone PostgreSQL",
    "skills-git-alt": "icone GIT",
    "skills-agile-alt": "icone methode Agile",
    "skills-figma-alt": "icone Figma",

    "formation-title": "Ma formation",
    "formation-part1-line1": "J’ai choisi de faire ma reconversion professionnelle à l’école O’Clock en suivant la formation Développeur Web Fullstack JavaScript.",
    "formation-part2-line1": "Cette formation intensive, d’une durée de 6 mois, proposée sur le format téléprésentiel prépare au Titre Professionnel Développeur Web et Web Mobile.",
    "formation-part2-line2": "Il s’agit d’un diplôme de niveau 5 (nomenclature Europe) correspondant au niveau III et inscrit au Répertoire National de la Certification Professionnelle (RNCP).",
    "formation-part2-line3": "Le titre Professionnel est une certification professionnelle délivrée au nom de l’Etat par le ministère chargé de l’emploi.",
    "formation-part3-line1": "L’objectif de cette formation est de fournir des compétences clé aux apprenants, leur permettant d’être directement employables à la fin du cursus. Comme par exemple :",

    "formation-li-line1": "Intégrer des pages web en HTML et CSS",
    "formation-li-line2": "Développer des fonctionnalités front-end en JavaScript",
    "formation-li-line3": "Concevoir des interfaces utilisateur",
    "formation-li-line4": "Concevoir, implémenter et utiliser des bases de données",
    "formation-li-line5": "Développer une application serveur avec Node.js et Express",
    "formation-li-line6": "Travailler en groupe sur un projet dans des conditions professionnelles.",

    "formation-part4-line1": "La formation a lieu tous les jours ouvrés de 9 h à 17 h.",
    "formation-part4-line2": "Après les cours, nous devions réaliser au minimum deux heures de travaux dirigés sous forme de challenge, mini-projet, d’exercices, de tutoriels, de sessions de corrections de bug, de veille professionnel, de lecture de documentation techniques etc …",
    "formation-part4-line3": "Ces travaux dirigés permettent d’approfondir les sujets vus en cours durant la journée, de découvrir de nouvelles notions (pédagogie inversée) et d’apprendre à collaborer sur des projets en équipe.",
    "formation-part4-line4": "L’évaluation des compétences est assurée durant la totalité de la formation grâce à un contrôle continu des travaux dirigés, d’évaluations en cours de formation, d’entretiens individuels et de conseils de classe interne entre chaque saison.",
    "formation-part4-line5": "Puis lors du contrôle final qui est la session de validation du Titre Professionnel.",
    "formation-part5-line1": "La formation est structurée en 4 phases distinctes : d’abord, le socle, suivit par un mois de spécialisation. Ensuite, vient le projet d’apothéose et enfin, le dernier mois est consacré à la préparation de la soutenance finale",

    "socle-part1-line1": "Le Socle est le nom donné à la première phase de la formation.",
    "socle-part1-line2": "Nous sommes formés aux langages et aux technologies qui constitueront une base de compétences.",
    "socle-part1-line3": "On apprend à utiliser les langages HTML, CSS, JavaScript, SQL et à utiliser Node.js à travers de multiples activités pédagogiques.",
    "socle-part1-line4": "Nous sommes également évalués tout au long du parcours, sur la base des compétences du référentiel du Titre Professionnel.",

    "socle-li1-title": "Module : Interface utilisateur :",
    "socle-li1-line1": "Prise en mains des outils du développeur",
    "socle-li1-line3": "Environnement Linux",
    "socle-li1-line4": "Versionnage de fichiers avec Git",

    "socle-li2-line1": "Introduction au JavaScript",
    "socle-li2-line2": "Syntaxe de base",
    "socle-li2-line3": "Conditions, boucles, fonctions",
    "socle-li2-line4": "JavaScript dans le navigateur",
    "socle-li2-line5": "DOM et événements",

    "socle-li3-title": "Module : Serveur :",
    "socle-li3-line2": "Client / Serveur : HTTP",
    "socle-li3-line3": "Node.js avec Express",
    "socle-li3-line4": "Portée des variables",

    "socle-li4-title": "Module : Gestion de données :",
    "socle-li4-line1": "Gestion de projet (méthodes Agile)",
    "socle-li4-line2": "Planification / Organisation",
    "socle-li4-line4": "Modèles de données",
    "socle-li4-line5": "SGBDR (système de gestion de bases de données Relationnels)",
    "socle-li4-line6": "Syntaxe SQL",

    "socle-li5-title": "Module : Architecture et projet :",
    "socle-li5-line1": "Programmation Orientée Objet",
    "socle-li5-line2": "Architecture MVC",
    "socle-li5-line4": "Authentification",
    "socle-li5-line5": "Rôles et droits d’accès",

    "socle-li6-line3": "Conception d’API Rest",
    "socle-li6-line4": "Git avancé",

    "socle-li7-title": "Module : SPA (Single Page Application) :",
    "socle-li7-line3": "Templates HTML",
    "socle-li7-line4": "Outillage (bundler, watcher)",

    "socle-li8-title": "Module : Déploiement",
    "socle-li8-line1": "Administration système",
    "socle-li8-line2": "Déploiement / mise en production",
    "socle-li8-line3": "Découverte et utilisation d’un CMS",
    "socle-li8-line4": "Introduction au NoSQL",
    "socle-li8-line5": "Ouverture sur d’autres langages",

    "specialization-title": "spécialisation",
    "specialization-part1-line1": "Le socle de connaissances nous a fourni des fondations solides.",
    "specialization-part1-line2": "Après cela, nous avons eu la possibilité de nous concentrer sur une technologie durant un mois entier, afin de maîtriser l'une des technologies les plus utilisées par les développeurs professionnels dans l'écosystème JavaScript.",
    "specialization-part1-line3": "Nous avions le choix entre React et Data & API.",
    "specialization-part1-line4": "J'ai opté pour la spécialisation React.",
    "specialization-li1-title": "Module: Développement front :",
    "specialization-li1-line1": "Outils de développement : Npm, Yarn, WebPack, Babel et ESlint",
    "specialization-li1-line2": "Programmation déclarative et fonctionnelle",
    "specialization-li1-line3": "Outils de test: Jest",

    "specialization-li2-title": "Module: JavaScript avancé :",
    "specialization-li2-line1": "Syntaxe ES2015",
    "specialization-li2-line2": "Rappels POO",
    "specialization-li2-line3": "Bundles et conventions",

    "specialization-li3-line2": "Composants, props, state et JSX",
    "specialization-li3-line3": "Cycles de vie",

    "apotheose-part1-line1": "Après 1 mois de spécialisation, nous entamons la phase du projet final qu' O’Clock nomme l’Apothéose.",
    "apotheose-part1-line2": "Nous sommes répartis en petits groupes de travail et avons 1 mois pour concevoir et réaliser un projet en mettant en pratique nos compétences récemment acquises.",
    "apotheose-part1-line3": "Nous sommes en autonomie pendant cette période, qui est une partie essentielle de la préparation pour l’obtention du Titre Professionnel.",
    "apotheose-part1-line4": "Cette étape reproduit les conditions de travail en entreprise et toutes les obligations que cela suppose. Taches individuelles, travail en groupe, dead line …",
    "apotheose-part2-line1": "Pour mon projet, notre équipe était composée de 5 développeurs : 3 back-end et 2 front-end dont je faisais partie.",
    "apotheose-part2-line2": "Nous nous sommes inspiré du cade de développement Scrum, basé sur les principes agiles pour mener à bien notre projet.",
    "apotheose-part3-line1": "Le projet d’Apothéose devait être structuré sous forme de sprints, avec l’obligations de respecter les délais.",
    "apotheose-part3-line2": "Chaque sprint durait une semaine :",

    "apotheose-li1-title": "Sprint 0 : Mise en place du projet :",
    "apotheose-li1-line1": "Réalisation du cahier des charges",
    "apotheose-li1-line2": "Identification des fonctionnalités à intégrer pour obtenir un MVP fiable, ainsi que ses évolutions potentielles",
    "apotheose-li1-line3": "Liste des technologies à utiliser pour les repos front-end et back-end",
    "apotheose-li1-line4": "Création des User Stories",
    "apotheose-li1-line5": "Établissement de l’arborescence du projet",
    "apotheose-li1-line6": "Création du MCD et d’un dictionnaire des données",
    "apotheose-li1-line7": "Identification des routes à mettre en place coté front-end et coté back-end",
    "apotheose-li1-line8": "Création des Wireframes pour toutes les pages du projet",

    "apotheose-li2-title": "Sprint 1 : Début du développement:",
    "apotheose-li2-line1": "Mise en place des repos",
    "apotheose-li2-line2": "Répartitions en deux équipes",
    "apotheose-li2-line3": "Début de la mise en place du projet",
    "apotheose-li2-line4": "Implémentation des fonctionnalités définies pour le MVP",

    "apotheose-li3-title": "Sprint 2 : Développement",
    "apotheose-li3-line1": "Amélioration des fonctionnalités existantes",
    "apotheose-li3-line2": "Ajout de nouvelles fonctionnalités",
    "apotheose-li3-line3": "Correction des bugs",

    "apotheose-li4-title": "Sprint 3 : Finalisation :",
    "apotheose-li4-line1": "Pas d’ajout de nouvelles fonctionnalités",
    "apotheose-li4-line2": "Finalisation des fonctionnalités existantes",
    "apotheose-li4-line3": "Vérification du bon fonctionnement de tout le système",
    "apotheose-li4-line4": "Travail sur le style et le design",
    "apotheose-li4-line5": "Préparation à la présentation finale.",

    "tpro-title": "Titre Professionnel",
    "tpro-part1-line1": "Après la validation de mon projet par l’équipe pédagogique d’O’Clock, j’ai pu me présenter au Titre Professionnel dans le cadre d’une session de validation à Paris.",
    "tpro-part1-line2": "J’ai dû rédiger un dossier de projet en lien avec le projet d’Apothéose et un dossier professionnel qui m’ont permis de décrire mon expérience professionnelle acquise en cours de formation, en accord avec chacune des compétences du Titre et ainsi, prouver que j’étais capable d’exercer le métier de Développeur Web de façon professionnelle.",
    "tpro-part2-line1": "Le titre professionnel est une certification professionnelle délivrée, au nom de L’Etat, par le ministère chargé de l’emploi.",
    "tpro-part2-line2": "O’clock est un centre d’examen agrée par le ministère et respecte un cahier des charges précis quant aux modalités de contrôle continu et présentation des stagiaires aux sessions de validation.",
    "tpro-part2-line3": "Le référentiel de certification du Titre Professionnel Développer Web et Web Mobile est le suivant :",

    "tpro-li1-title": "Activité n°1 : Développer la partie front-end d’une application web ou web mobile en intégrant les recommandations de sécurité",
    "tpro-li1-line1": "Maquetter une application",
    "tpro-li1-line2": "Réaliser une interface utilisateur web statique et adaptable",
    "tpro-li1-line3": "Développer une interface utilisateur web dynamique",

    "tpro-li2-title": "Activité n°2 : Développer la partie back-end d’une application web ou web mobile en intégrant les recommandations de sécurité",
    "tpro-li2-line1": "Créer une base de données",
    "tpro-li2-line2": "Développer les composants d’accès aux données",
    "tpro-li2-line3": "Développer la partie back-end d’une application web ou web mobile",

    "tpro-part3-line1": "Un jury composé de professionnels habilités par le ministère chargé de l’emploi s’est alors prononcé sur ma maîtrise de ces compétences en se basant sur les éléments suivants :",
    "tpro-li3-line1": "Épreuve de synthèse : dossier de présentation de mon travail",
    "tpro-li3-line2": "Dossier professionnel : description des activités réalisées pendant la formation",
    "tpro-li3-line3": "Résultats des évaluations en cours de formation (ECF)",
    "tpro-li3-line4": "Entretien avec présentation du projet, questions du jury sur le projet, questions du jury sur le parcours personnel et dossier professionnel.",

    "2ndspecialisation-title": "Deuxième spécialisation",
    "2ndspecialisation-part1-line1": "Après l’obtention de mon Titre Professionnel, ayant accès aux replays des cours et aux fiches techniques de la spécialisation back-end : Data & Api, j’ai décidé de suivre cette formation de façon autonome",
    "2ndspecialisation-li1-line1": "Manipulation de données structurées",
    "2ndspecialisation-li1-line2": "Systèmes SQL",
    "2ndspecialisation-li1-line3": "Procédures stockées",
    "2ndspecialisation-li1-line4": "Agrégats",
    "2ndspecialisation-li1-line5": "DV (visualisation)",

    "2ndspecialisation-li2-line1": "Mise à niveau JavaScript/Node",
    "2ndspecialisation-li2-line2": "Frameworks NodeJS",
    "2ndspecialisation-li2-line3": "Programmation Fonctionnelle",
    "2ndspecialisation-li2-line4": "Expressions Régulières",

    "2ndspecialisation-li3-line1": "Manipulation de données non structurées",
    "2ndspecialisation-li3-line4": "Agrégats",

    "2ndspecialisation-li4-line1": "Principes de l’intelligence Artificielle",
    "2ndspecialisation-li4-line3": "Modèles prédictifs"
  },

  "page-vz": {
    "presentationImg-alt": "Image du projet VictoryZone",
    "sub-title": "Projet fin d'études",
    "description-part1-line1": "À l’ère du numérique en perpétuelle évolution, de nouvelles opportunités professionnelles se dessinent, ouvrant la voie à des carrières passionnantes et innovantes.",
    "description-part1-line2": "Une entreprise fictive spécialisée dans le recrutement et la reconversion professionnelle dans le domaine du numérique s’est lancée dans le projet de créer et gérer sa propre équipe e-sports professionnelle en offrant aux passionnés du gaming compétitif une chance unique de transformer leur passion en une carrière lucrative et enrichissante.",
    "description-part1-line3": "En réponse à ce besoin, nous avons mis en place une application pour représenter cette équipe e-sport : la VictoryZone !",
    "description-part2-line1": "Cette application vise à promouvoir l'équipe en offrant une présentation complète et attractive.",
    "description-part2-line2": "Les visiteurs peuvent suivre de près les activités de l'équipe à travers des actualités régulières sous forme d'articles, de présentation détaillées des membres, des résultats de match et d'événements à venir.",
    "description-part2-line3": "De plus, les nouveaux talents passionnés d'e-sport ont la possibilité de postuler pour rejoindre l'équipe via un formulaire de recrutement.",
    "description-part2-line4": "Un espace administrateur est disponible pour gérer les données du site, comme l'ajout, la modification ou la suppression du contenu du site.",
    "description-part2-line5": "En combinant ces objectifs, l'application aspire à renforcer la visibilité et la compétitivité de l'équipe tout en contribuant au développement et à l'essor de la scène e-sport en accueillant et en formant de nouveaux talents prometteurs.",
    "description-part3-line1": "Cette application a été réalisée dans le cadre de projet de fin d’études de ma formation chez O’Clock en vue du passage du Titre Professionnel.",
    "description-part3-line2": "Le sujet nous a été donné et nous avions une deadline d’ 1 mois pour réaliser le MVP complet de cette application.",
    "description-part3-line3": "Nous étions répartis dans un groupe de 5 développeurs : 3 back-end et 2 front-end dont je faisais partie.",
    "description-part3-line4": "J’avais les rôles de Lead developper front-end et référent front-end.",
    "description-part3-line5": "Nous nous sommes inspirés du cadre de développement SCRUM, basé sur les principes agiles pour mener à bien notre projet.",
    "description-part3-line6": "Le développement devait être structuré sous forme de sprints d’une durée d’une semaine chacun :",

    "description-li1-title": "Sprint 0: réalisation du cahier des charges et mise en place du projet :",
    "description-li1-line1": "Identification des fonctionnalités à intégrer pour obtenir un MVP fiable, ainsi que ses évolutions potentielles",
    "description-li1-line2": "Liste des technologies à utiliser pour les repos front-end et back-end",
    "description-li1-line3": "Création des User Stories",
    "description-li1-line4": "Établissement de l’arborescence du projet",
    "description-li1-line5": "Création du MCD et d’un dictionnaire des données",
    "description-li1-line6": "Identification des routes à mettre en place coté front-end et back-end",
    "description-li1-line7": "Création des Wireframes pour toutes les pages du projet",

    "description-li2-title": "Sprint 1: Début du développement :",
    "description-li2-line1": "Mise en place des repos",
    "description-li2-line2": "Répartitions en deux équipes",
    "description-li2-line3": "Début de la mise en place du projet",
    "description-li2-line4": "Implémentation des fonctionnalités définie pour le MVP",

    "description-li3-title": "Sprint 2: Suite du développement :",
    "description-li3-line1": "Amélioration des fonctionnalités existantes",
    "description-li3-line2": "Ajout de nouvelles fonctionnalités",
    "description-li3-line3": "Correction des bugs",

    "description-li4-title": "Sprint 3: Finalisation :",
    "description-li4-line1": "Plus d’ajout de nouvelles fonctionnalités",
    "description-li4-line2": "Finalisation des fonctionnalités existantes",
    "description-li4-line3": "Vérification du bon fonctionnement de tout le système",
    "description-li4-line4": "Travail sur le style et le design",
    "description-li4-line5": "Préparation à la présentation finale",

    "button-arialabel": "Visitez le site Victory Zone",

    "desktop-imgalt-1": "Image section présentation du project VictoryZone version desktop",
    "desktop-imgalt-2": "Image section team du project VictoryZone version desktop",
    "desktop-imgalt-3": "Image section calendrier du project VictoryZone version desktop",
    "desktop-imgalt-4": "Image section articles du project VictoryZone version desktop",
    "desktop-imgalt-5": "Image page formulaire de recrutement du project VictoryZone version desktop",
    "desktop-imgalt-6": "Image page administrateur du project VictoryZone version desktop",
    "mobile-imgalt-1": "Image section présentation du project VictoryZone version mobile",
    "mobile-imgalt-2": "Image section team du project VictoryZone version mobile",
    "mobile-imgalt-3": "Image section calendrier du project VictoryZone version mobile",
    "mobile-imgalt-4": "Image section articles du project VictoryZone version desktop",
    "mobile-imgalt-5": "Image footer du project VictoryZone version mobile",
    "mobile-imgalt-6": "Image page administrateur du project VictoryZone version mobile",

    "other-projects": "Mes autres projets :"
  },

  "page-okanban": {
    "presentationImg-alt": "Image du projet Okanban",
    "sub-title": "Application fullstack",

    "description-part1-line1": "OKANBAN est une application de gestion de projet en ligne qui utilise un système de tableau Kanban basé sur le même principe que Trello.",
    "description-part1-line2": "Son fonctionnement repose sur des tableaux composés de listes, et chaque liste contient des cartes qui représentent des taches ou des éléments à traiter.",
    "description-part1-line3": "Les utilisateurs créent des tableaux pour leurs différents projets ou domaine d’activité, puis ils ajoutent des listes correspondant aux différentes étapes ou catégories de ces projets.",
    "description-part1-line4": "Ensuite, ils créent des cartes à l’intérieur de chaque liste pour représenter des taches, des idées ou des objectifs spécifiques.",
    "description-part1-line5": "Les cartes peuvent être déplacées facilement d’une liste à l’autre, ce qui permet de suivre leur progression à travers les différentes étapes du projet.",

    "description-part2-line1": "J’ai développé cette application lors de ma formation chez O’Clock.",
    "description-part2-line2": "J ’ai utilisé Node.js et Express pour la création du serveur et la gestion des routes.",
    "description-part2-line3": "La base de données est mise en place avec postgreSQL, et Sequelize est utilisé comme ORM pour faciliter les opérations de base de données.",
    "description-part2-line4": "Lors de la conception de la base de données, j’ai réalisé les users-stores, MCD, MLD et dictionnaire des données.",
    "description-part2-line5": "L’application suit une architecture MCV (Modèle-Vue-Controleur).",
    "description-part2-line6": "Les modèles sont définis pour représenter les entités principales de l’application telles que les listes, les cartes et les tags avec des associations configurées pour gérer les relations entre elles.",

    "button-arialabel": "Redirection vers la page Github du repos contenant le code du back-end",
    "desktop-imgalt-1": "Aperçu du projet oKanban en version desktop",
    "mobile-imgalt-1": "Aperçu du projet oKanban en version mobile",
    "other-projects": "Mes autres projets :"
  },

  "page-portfolio": {
    "presentationImg-alt": "Image du projet Portfolio v1",
    "sub-title": "Projet personnel",

    "description-part1-line1": "Ce portfolio représente le projet que vous explorez actuellement, dans sa première version.",
    "description-part1-line2": "Il propose une plateforme détaillée pour présenter mes compétences, expériences, projets et objectifs. ",
    "description-part1-line3": "J’ai opté pour un design minimaliste, cherchant à allier l’élégance de la simplicité avec une structure claire et organisée.",
    "description-part1-line4": "L’objectif principal était de créer une interface épurée et conviviale, mettant en avant le contenu tout en offrant une expérience utilisateur agréable.",

    "description-part2-line1": "J’ai développé ce projet en utilisant React avec le framework Next.js version 14. ",
    "description-part2-line2": "J’ai choisi d’utiliser Typescript et EsLint airbnb pour une meilleure structuration du code. ",
    "description-part2-line3": "Le style est réalisé avec Scss pour une gestion plus efficace des feuilles de style. ",
    "description-part2-line4": "J’ai mis en place un système de traduction grâce à la bibliothèque Next-Intl, permettant aux utilisateurs de basculer entre le français et l’anglais. ",
    "description-part2-line5": "Les traductions sont stockées dans des fichiers .JSON et sont ensuite récupérées dans les fichiers JSX des pages et des composants, ce qui permet d’afficher le contenu dans la langue appropriée en fonction de la sélection de l’utilisateur.",

    "button-arialabel": "Redirection vers la page Github du repos contenant le code du projet",
    "other-projects": "Mes autres projets :"
  }
}
